app/controllers/scores_controller.rb

SELECT "scores".* FROM "scores" WHERE "scores"."id" = ? LIMIT 1  [["id", "3"]]
---
	def show
		id = params[:id]
		@score = Score.find(id)

INSERT INTO "scores" ("created_at", "first_name", "last_name", "school", "score", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
	def create
		@score = Score.create!(params[:newscore])

SELECT "scores".* FROM "scores" WHERE "scores"."id" = ? LIMIT 1  [["id", "5"]]
---
	def edit
		@score = Score.find params[:id]

SELECT "scores".* FROM "scores" WHERE "scores"."id" = ? LIMIT 1  [["id", "5"]]
UPDATE "scores" SET "score" = 1011, "updated_at" = '2013-12-10 10:14:27.480702' WHERE "scores"."id" = 5
---
	def update
		@score = Score.find params[:id]
		@score.update_attributes!(params[:score])

SELECT "scores".* FROM "scores" WHERE "scores"."id" = ? LIMIT 1  [["id", "4"]]
DELETE FROM "scores" WHERE "scores"."id" = ?  [["id", 4]]
---
	def destroy
		@score = Score.find params[:id]
		@score.destroy